# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 22, size=(n_rows, n_cols)),
                 columns=cols)

df.head()

    A   B   C   D   E
0  14  14  15  21  13
1  17  10  14  18  20
2   9  19   9  14  11
3   8  18  20  17  17
4   5   9  21   4  12

In [3]:
df1 = df.copy(deep = True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0  14  14  15  21  13
2   9  19   9  14  11
3   8  18  20  17  17

In [6]:
df2 = df.copy(deep= True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1  17  10  14  18  20
2   9  19   9  14  11
4   5   9  21   4  12

# Menggabungkan dua Data Frame

In [7]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

   A   B  C   D   E
0  9  19  9  14  11

In [8]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0  14  14  15  21  13
1   9  19   9  14  11
2   8  18  20  17  17
3  17  10  14  18  20
4   5   9  21   4  12